{
    "perfiles": [

  
      {
        "id": 1,
        "nombre": "P1",
        "descripcion": "P1. El egresado desarrolla y evalúa proyectos y/o soluciones tecnológicas que respondan a las necesidades de aprendizaje, poniendo en ejercicio técnicas avanzadas de programación, especialmente en contextos educativos y con tecnologías actualizadas con capacidades de colaboración y liderazgo en equipos interdisciplinarios.",
        "competencias": {
            "C1": {
                "resultados": ["R6", "R7"]
            },
            "C2": {
                "resultados": ["R1", "R3", "R5", "R6"]
            }

                }
            },
        
      {
        "id": 2,
        "nombre": "P2",
        "descripcion": "P2. El egresado gestiona didácticamente los ambientes de aprendizaje fundamentados en principios psicoeducativos tomando en cuenta el contexto y las reflexiones de situaciones específicas.",
        "competencias": {
            "C2": {
                "resultados": ["R1", "R3", "R5", "R6"]
            },
            "C3": {
                "resultados": ["R2", "R4", "R7"]
            },
            "C4": {
                "resultados": ["R1", "R3", "R4"]
            },
            "C5": {
                "resultados": ["R1", "R3", "R4"]
            }

                }
      },
      
      {
        "id": 3,
        "nombre": "P3",
        "descripcion": "P3. El egresado de este programa produce contenido audiovisual y multimedia de alta calidad en respuesta a necesidades y demandas específicas del mercado, el sistema educativo o de las industrias culturales y creativas.",
        "competencias": {
            "C2": {
                "resultados": ["R1", "R3", "R5", "R6"]
            },
            "C5": {
                "resultados": ["R1", "R3", "R4"]
            },
            "C6": {
                "resultados": ["R1", "R3"]
            }

                }

        
      },
      
      {
        "id": 4,
        "nombre": "P4",
        "descripcion": "P4. El egresado se desempeña con idoneidad como docente en el área de tecnología e informática en los diferentes niveles de educación gestionando proyectos de aula y de investigación a partir de la reflexión sobre su práctica en diversos contextos socioculturales, desde una perspectiva pedagógica y didáctica innovadora, para el mejoramiento de la calidad de la educación, utilizando las tecnologías de la información y la comunicación.",
        "competencias": {
            "C4": {
                "resultados": ["R1", "R3", "R4"]
            },
            "C6": {
                "resultados": ["R1", "R3"]
            },
            "C7": {
                "resultados": ["R2", "R3", "R5"]
            }

                }
      },
      
      {
        "id": 5,
        "nombre": "P5",
        "descripcion": "P5. Formula planes estratégicos en organizaciones educativas y gestiona su ejecución a partir de la generación de diversos escenarios con metodologías que respondan a los requerimientos y apuesta de la organización, considerando las políticas educativas nacionales y las tendencias globales.",
        "competencias": {
            "C2": {
                "resultados": ["R1", "R3", "R5", "R6"]
            },
            "C3": {
                "resultados": ["R2", "R4", "R7"]
            },
            "C7": {
                "resultados": ["R2", "R3", "R5"]
            }

                }
      }
      
    ],






    "competencias": [
        {
            "id": 11,
            "nombre": "C1",
            "descripcion": "C1. Domina conceptual y en forma práctica los conceptos relacionados con la programación de computadores, especialmente aquellos orientados al ámbito educativo y basados en tecnologías web modernas.",
            "perfiles": {
                "P1": {
                    "resultados": ["R6", "R7"]
                } 
            }
            
        },
        {
            "id": 22,
            "nombre": "C2",
            "descripcion": "C2. Dirige o hace parten de equipos interdisciplinarios para el trabajo colaborativo en el desarrollo de recursos educativos, objetos virtuales, video juegos educativos o software educativo teniendo en cuenta criterios pedagógicos, didácticos, estéticos, tecnológicos, ingenieriles y de usabilidad.",
            "perfiles": {
                "P1": {
                    "resultados": ["R1", "R3", "R5", "R6"]
                },
                "P2": {
                    "resultados": ["R1", "R3", "R5", "R6"]
                },
                "P3": {
                    "resultados": ["R1", "R3", "R5", "R6"]
                },
                "P5": {
                    "resultados": ["R1", "R3", "R5", "R6"]
                }
            }
        },

        {
            "id": 33,
            "nombre": "C3",
            "descripcion": "C3. Aplica conocimientos, habilidades, y criterios en la resolución de problemas complejos presentes en ecosistemas educativos mediados por tecnología desde una perspectiva de cambio e innovación",
            "perfiles": {
                "P2": {
                    "resultados": ["R2", "R4", "R7"]
                },
                "P5": {
                    "resultados": ["R2", "R4", "R7"]
                }
            }
          },
          {
            "id": 44,
            "nombre": "C4",
            "descripcion": "C4. Aplica de manera integrada los fundamentos de la psicología del aprendizaje, la pedagogía y la tecnología educativa para la gestión didáctica de los ambientes de enseñanza – aprendizaje en coherencia con los nuevos desafíos.",
            "perfiles": {

                "P2": {
                    "resultados": ["R1", "R3", "R4"]
                },
                "P4": {
                    "resultados": ["R1", "R3", "R4"]
                }

            }
          },
          {
            "id": 55,
            "nombre": "C5",
            "descripcion": "C5. Planea y realiza Producciones audiovisuales en imagen, animación, fotografía, radio y audiovisuales con uso de herramientas modernas, criterio estético y un enfoque de comunicación adecuado, aplicados a la industria, la educación o las redes sociales.",
            "perfiles": {
                "P3": {
                    "resultados": ["R1", "R3", "R4"]
                }
            }
          },
          {
            "id": 66,
            "nombre": "C6",
            "descripcion": "C6. Utiliza responsablemente las tecnologías encaminadas al fortalecimiento de los procesos de desarrollo educativo, social, económico, político, cultural; asumiendo una postura ética en el trabajo individual y colectivo.",
            "perfiles": {

                "P2": {
                    "resultados": ["R1", "R2", "R3"]
                },
                "P3": {
                    "resultados": ["R1", "R2", "R3"]
                },
                "P4": {
                    "resultados": ["R1", "R2", "R3"]
                }
            }
          },
          {
            "id": 77,
            "nombre": "C7",
            "descripcion": "C7. Gestiona y lidera cambios educativos a través de la investigación, enseñanza y aprendizaje de las tecnologías, contribuyendo al mejoramiento de la calidad de la educación. Lidera equipos de trabajo de alto rendimiento aprovechando eficientemente los talentos, los recursos, las capacidades, habilidades y destrezas en la solución de problemas organizacionales. ",
            "perfiles": {
                "P4": {
                    "resultados": ["R2", "R3", "R5"]
                },
                "P5": {
                    "resultados": ["R2", "R3", "R5"]
                }
            }
          }
        
      ],





      "resultados": [
        {
            "id": 111,
            "nombre": "R1",
            "descripcion": "RP1. Diseña ambientes educativos mediados por tecnología que aborden de manera efectiva las necesidades de aprendizaje en diversos contextos, utilizando enfoques innovadores.",
            "competencias": {
                "C2": {
                    "perfiles": ["P1", "P2", "P3", "P5"]
                },
                "C4": {
                    "perfiles": ["P2", "P4"]
                },
                "C5": {
                    "perfiles": ["P3"]
                },
                "C6": {
                    "perfiles": ["P2", "P3", "P4"]
                }
            }      
        },
        {
            "id": 222,
            "nombre": "R2",
            "descripcion": "RP2. Lidera cambios educativos mediante la investigación, la enseñanza y el aprendizaje de tecnologías educativas, contribuyendo al mejoramiento de la calidad de la educación en sus respectivos entornos.",
            "competencias": {
                "C3": {
                    "perfiles": ["P2", "P5"]
                },
                "C6": {
                    "perfiles": ["P2", "P3", "P4"]
                },
                "C7": {
                    "perfiles": ["P4", "P5"]
                }
            }   
          },
          {
            "id": 333,
            "nombre": "R3",
            "descripcion": "RP3. Utiliza tecnologías de manera responsable y ética, aplicándolas para fortalecer los procesos de desarrollo educativo, social, económico, político y cultural, tanto en el trabajo individual como en el trabajo colaborativo.",
            "competencias": {
                "C2": {
                    "perfiles": ["P1", "P2", "P3", "P5"]
                },
                "C4": {
                    "perfiles": ["P2", "P4"]
                },
                "C5": {
                    "perfiles": ["P3"]
                },
                "C6": {
                    "perfiles": ["P2", "P3", "P4"]
                },
                "C7": {
                    "perfiles": ["P4", "P5"]
                }
            }   
          },
          {
            "id": 444,
            "nombre": "R4",
            "descripcion": "RP4.  Aplica de forma integrada los fundamentos del aprendizaje, la pedagogía, la didáctica, la comunicación y la tecnología educativa, para abordar problemas complejos y fomentar la innovación en ecosistemas educativos mediados por tecnología.",
            "competencias": {
                "C3": {
                    "perfiles": ["P2", "P5"]
                },
                "C4": {
                    "perfiles": ["P2", "P4"]
                },
                "C5": {
                    "perfiles": ["P3"]
                }
            }   
          },
          {
            "id": 555,
            "nombre": "R5",
            "descripcion": "RP5. Desarrolla habilidades avanzadas de comunicación en su lengua materna y en una segunda lengua, además de adquirir competencias generales del siglo 21, como pensamiento crítico, resolución de problemas, trabajo en equipo y adaptabilidad.",
            "competencias": {
                "C2": {
                    "perfiles": ["P1", "P2", "P3", "P5"]
                },
                "C7": {
                    "perfiles": ["P4", "P5"]
                }
            }   
          },
          {
            "id": 666,
            "nombre": "R6",
            "descripcion": "RP6. Diseña, desarrolla e implementa diversos tipos de software, incluyendo aplicaciones educativas y algoritmos adaptados a las necesidades de la educación para contribuir de manera significativa al avance de la educación mediante soluciones tecnológicas innovadoras y la digitalización de procesos educativos.",
            "competencias": {
                "C1": {
                    "perfiles": ["P1"]
                },
                "C2": {
                    "perfiles": ["P1", "P2", "P3", "P5"]
                }
            }   
          },
          {
            "id": 777,
            "nombre": "R7",
            "descripcion": "RP7. Comprende y utiliza lenguajes artificiales para representar situaciones cotidianas y generar soluciones a partir de estrategias lógico deductivas.",
            "competencias": {
                "C1": {
                    "perfiles": ["P1"]
                },
                "C3": {
                    "perfiles": ["P2", "P5"]
                }
            }   
          }
      ]

  }
  